results/sweep-20260817-012503/bench-c1.log

Throughput
note: saving the result JSON to /root/inference-poc/results/sweep-20260817-012503/result-c1.json
Warning: You are sending unauthenticated requests to the HF Hub. Please set a HF_TOKEN to enable higher rate limits and faster downloads.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x756ff9750d60>, trust_remote_code=False, seed=0, num_prompts=8, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=2048, random_output_len=512, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, bfcl_categories=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='openai-chat', base_url=None, host='localhost', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=1, model='deepseek-ai/DeepSeek-V4-Pro-0813', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, probe_request_rate=0.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename='/root/inference-poc/results/sweep-20260817-012503/result-c1.json', ignore_eos=False, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-235a3db3-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 08-17 01:27:12 [config.py:774] Detected quantization_config.scale_fmt=ue8m0; enabling UE8M0 for DeepGEMM.
INFO 08-17 01:27:13 [utils.py:90] Sampling input_len from [2048, 2048] and output_len from [512, 512]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 1
100%|██████████| 8/8 [00:50<00:00,  6.36s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     8         
Failed requests:                         0         
Maximum request concurrency:             1         
Benchmark duration (s):                  50.90     
Total input tokens:                      16416     
Total generated tokens:                  4096      
Request throughput (req/s):              0.16      
Output token throughput (tok/s):         80.48     
Peak output token throughput (tok/s):    60.00     
Peak concurrent requests:                2.00      
Total token throughput (tok/s):          403.01    
---------------Time to First Token----------------
Mean TTFT (ms):                          2429.31   
Median TTFT (ms):                        258.66    
P99 TTFT (ms):                           16407.19  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          7.70      
Median TPOT (ms):                        7.79      
P99 TPOT (ms):                           12.89     
---------------Inter-token Latency----------------
Mean ITL (ms):                           17.34     
Median ITL (ms):                         16.95     
P99 ITL (ms):                            34.06     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          6361.71   
Median E2EL (ms):                        4341.07   
P99 E2EL (ms):                           18648.00  
---------------Speculative Decoding---------------
Acceptance rate (%):                     17.26     
Acceptance length:                       2.21      
Drafts:                                  1857      
Draft tokens:                            12999     
Accepted tokens:                         2244      
Per-position acceptance (%):
  Position 0:                            51.43     
  Position 1:                            29.56     
  Position 2:                            16.21     
  Position 3:                            10.50     
  Position 4:                            7.05      
  Position 5:                            3.72      
  Position 6:                            2.37      
==================================================